---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
source: html/fae6af2b-abc4-01ae-b9fe-c6bf89722495.htm
---
# VertexStreamPositionNormal Methods

Inserts a VertexStreamPositionNormal into the stream and associated buffer.